#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`

Show Plan

```terraform
module.cloudflare_lilja_io_setup.data.cloudflare_zone.lilja_dot_io: Reading...
module.cloudflare_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"]: Refreshing state... [id=39a68ea4e94f07561df0332d40e1b58b]
module.cloudflare_setup.cloudflare_record.mx_proton_protomain_verification: Refreshing state... [id=5a64b437361c0d87c612affbabf5a1b5]
module.cloudflare_setup.cloudflare_record.mx_proton_spf1: Refreshing state... [id=63d176ec8068198506fb92d83af88bee]
module.cloudflare_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"]: Refreshing state... [id=d84a8273fb7e349226026d9960ed5ab4]
module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"]: Refreshing state... [id=46d7a5f73307bd1c5c754c566c64b8e4]
module.cloudflare_setup.cloudflare_record.txt_dmarc: Refreshing state... [id=a8e709d83e8eb264c9efb249b6b7840a]
module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"]: Refreshing state... [id=11089f2eb48f12459120121b9509684c]
module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"]: Refreshing state... [id=870c69315aba7c377a062307e01a17fc]
module.cloudflare_lilja_io_setup.data.cloudflare_zone.lilja_dot_io: Read complete after 0s [id=801ec7bc35b2abc9580d847c7b5c6f56]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"] will be created
  + resource "cloudflare_record" "cname_dkim1" {
      + allow_overwrite = false
      + content         = "protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "protonmail._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"] will be created
  + resource "cloudflare_record" "cname_dkim1" {
      + allow_overwrite = false
      + content         = "protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "protonmail2._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"] will be created
  + resource "cloudflare_record" "cname_dkim1" {
      + allow_overwrite = false
      + content         = "protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch."
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "protonmail3._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"] will be created
  + resource "cloudflare_record" "mx_proton_mail" {
      + allow_overwrite = false
      + comment         = "MX records for lilja.io zone."
      + content         = "mail.protonmail.ch"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lilja.io"
      + priority        = 1
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"] will be created
  + resource "cloudflare_record" "mx_proton_mail" {
      + allow_overwrite = false
      + comment         = "MX records for lilja.io zone."
      + content         = "mailsec.protonmail.ch"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lilja.io"
      + priority        = 2
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_protomain_verification will be created
  + resource "cloudflare_record" "mx_proton_protomain_verification" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lilja.io"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.mx_proton_spf1 will be created
  + resource "cloudflare_record" "mx_proton_spf1" {
      + allow_overwrite = false
      + content         = "v=spf1 include:_spf.protonmail.ch mx ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "lilja.io"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_lilja_io_setup.cloudflare_record.txt_dmarc will be created
  + resource "cloudflare_record" "txt_dmarc" {
      + allow_overwrite = false
      + content         = "v=DMARC1; p=quarantine"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56"
    }

  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail._domainkey"] will be destroyed
  # (because cloudflare_record.cname_dkim1 is not in configuration)
  - resource "cloudflare_record" "cname_dkim1" {
      - allow_overwrite = false -> null
      - content         = "protonmail.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" -> null
      - created_on      = "2025-02-01T14:44:22.97234Z" -> null
      - hostname        = "protonmail._domainkey.lilja.io" -> null
      - id              = "46d7a5f73307bd1c5c754c566c64b8e4" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2025-02-01T14:44:22.97234Z" -> null
      - name            = "protonmail._domainkey" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail2._domainkey"] will be destroyed
  # (because cloudflare_record.cname_dkim1 is not in configuration)
  - resource "cloudflare_record" "cname_dkim1" {
      - allow_overwrite = false -> null
      - content         = "protonmail2.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" -> null
      - created_on      = "2025-02-01T14:44:23.459029Z" -> null
      - hostname        = "protonmail2._domainkey.lilja.io" -> null
      - id              = "11089f2eb48f12459120121b9509684c" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2025-02-01T14:44:23.459029Z" -> null
      - name            = "protonmail2._domainkey" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_setup.cloudflare_record.cname_dkim1["protonmail3._domainkey"] will be destroyed
  # (because cloudflare_record.cname_dkim1 is not in configuration)
  - resource "cloudflare_record" "cname_dkim1" {
      - allow_overwrite = false -> null
      - content         = "protonmail3.domainkey.dqnuquyqjndrlhl3kd676hycw5l4a2hanxco7ab7n56elpexeanaa.domains.proton.ch" -> null
      - created_on      = "2025-02-01T14:44:22.719372Z" -> null
      - hostname        = "protonmail3._domainkey.lilja.io" -> null
      - id              = "870c69315aba7c377a062307e01a17fc" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2025-02-01T14:44:22.719372Z" -> null
      - name            = "protonmail3._domainkey" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_setup.cloudflare_record.mx_proton_mail["mail.protonmail.ch"] will be destroyed
  # (because cloudflare_record.mx_proton_mail is not in configuration)
  - resource "cloudflare_record" "mx_proton_mail" {
      - allow_overwrite = false -> null
      - comment         = "MX records for lilja.io zone." -> null
      - content         = "mail.protonmail.ch" -> null
      - created_on      = "2025-02-01T14:44:23.974226Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "39a68ea4e94f07561df0332d40e1b58b" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2025-02-01T14:44:23.974226Z" -> null
      - name            = "lilja.io" -> null
      - priority        = 1 -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - ttl             = 1 -> null
      - type            = "MX" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
    }

  # module.cloudflare_setup.cloudflare_record.mx_proton_mail["mailsec.protonmail.ch"] will be destroyed
  # (because cloudflare_record.mx_proton_mail is not in configuration)
  - resource "cloudflare_record" "mx_proton_mail" {
      - allow_overwrite = false -> null
      - comment         = "MX records for lilja.io zone." -> null
      - content         = "mailsec.protonmail.ch" -> null
      - created_on      = "2025-02-01T14:44:23.220929Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "d84a8273fb7e349226026d9960ed5ab4" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2025-02-01T14:44:23.220929Z" -> null
      - name            = "lilja.io" -> null
      - priority        = 2 -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - ttl             = 1 -> null
      - type            = "MX" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
    }

  # module.cloudflare_setup.cloudflare_record.mx_proton_protomain_verification will be destroyed
  # (because cloudflare_record.mx_proton_protomain_verification is not in configuration)
  - resource "cloudflare_record" "mx_proton_protomain_verification" {
      - allow_overwrite = false -> null
      - content         = (sensitive value) -> null
      - created_on      = "2023-05-28T21:40:49.268193Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "5a64b437361c0d87c612affbabf5a1b5" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2023-05-28T21:40:49.268193Z" -> null
      - name            = "lilja.io" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "protonmail-verification=9a69211edf7217e6d5f99e5507b53feb1b356f0d" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_setup.cloudflare_record.mx_proton_spf1 will be destroyed
  # (because cloudflare_record.mx_proton_spf1 is not in configuration)
  - resource "cloudflare_record" "mx_proton_spf1" {
      - allow_overwrite = false -> null
      - content         = "v=spf1 include:_spf.protonmail.ch mx ~all" -> null
      - created_on      = "2023-05-28T21:40:49.464628Z" -> null
      - hostname        = "lilja.io" -> null
      - id              = "63d176ec8068198506fb92d83af88bee" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2023-05-28T21:40:49.464628Z" -> null
      - name            = "lilja.io" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=spf1 include:_spf.protonmail.ch mx ~all" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cloudflare_setup.cloudflare_record.txt_dmarc will be destroyed
  # (because cloudflare_record.txt_dmarc is not in configuration)
  - resource "cloudflare_record" "txt_dmarc" {
      - allow_overwrite = false -> null
      - content         = "v=DMARC1; p=quarantine" -> null
      - created_on      = "2024-03-07T21:40:14.581184Z" -> null
      - hostname        = "_dmarc.lilja.io" -> null
      - id              = "a8e709d83e8eb264c9efb249b6b7840a" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-03-07T21:40:14.581184Z" -> null
      - name            = "_dmarc" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=DMARC1; p=quarantine" -> null
      - zone_id         = "801ec7bc35b2abc9580d847c7b5c6f56" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 0 to change, 8 to destroy.
```

*Pusher: @jlilja, Action: `pull_request`, Workflow: `Plan Terraform code on PR`*